GopalSaraf/Practicals/PSDL/include/proc/pic16lf1575.inc
// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0DABh
// bitfield definitions
PWM2CON_MODE_POSN                        equ 0002h
PWM2CON_MODE_POSITION                    equ 0002h
PWM2CON_MODE_SIZE                        equ 0002h
PWM2CON_MODE_LENGTH                      equ 0002h
PWM2CON_MODE_MASK                        equ 000Ch
PWM2CON_POL_POSN                         equ 0004h
PWM2CON_POL_POSITION                     equ 0004h
PWM2CON_POL_SIZE                         equ 0001h
PWM2CON_POL_LENGTH                       equ 0001h
PWM2CON_POL_MASK                         equ 0010h
PWM2CON_OUT_POSN                         equ 0005h
PWM2CON_OUT_POSITION                     equ 0005h
PWM2CON_OUT_SIZE                         equ 0001h
PWM2CON_OUT_LENGTH                       equ 0001h
PWM2CON_OUT_MASK                         equ 0020h
PWM2CON_OE_POSN                          equ 0006h
PWM2CON_OE_POSITION                      equ 0006h
PWM2CON_OE_SIZE                          equ 0001h
PWM2CON_OE_LENGTH                        equ 0001h
PWM2CON_OE_MASK                          equ 0040h
PWM2CON_EN_POSN                          equ 0007h
PWM2CON_EN_POSITION                      equ 0007h
PWM2CON_EN_SIZE                          equ 0001h
PWM2CON_EN_LENGTH                        equ 0001h
PWM2CON_EN_MASK                          equ 0080h
PWM2CON_PWM2MODE0_POSN                   equ 0002h
PWM2CON_PWM2MODE0_POSITION               equ 0002h
PWM2CON_PWM2MODE0_SIZE                   equ 0001h
PWM2CON_PWM2MODE0_LENGTH                 equ 0001h
PWM2CON_PWM2MODE0_MASK                   equ 0004h
PWM2CON_PWM2MODE1_POSN                   equ 0003h
PWM2CON_PWM2MODE1_POSITION               equ 0003h
PWM2CON_PWM2MODE1_SIZE                   equ 0001h
PWM2CON_PWM2MODE1_LENGTH                 equ 0001h
PWM2CON_PWM2MODE1_MASK                   equ 0008h
PWM2CON_PWM2MODE_POSN                    equ 0002h
PWM2CON_PWM2MODE_POSITION                equ 0002h
PWM2CON_PWM2MODE_SIZE                    equ 0002h
PWM2CON_PWM2MODE_LENGTH                  equ 0002h
PWM2CON_PWM2MODE_MASK                    equ 000Ch
PWM2CON_PWM2POL_POSN                     equ 0004h
PWM2CON_PWM2POL_POSITION                 equ 0004h
PWM2CON_PWM2POL_SIZE                     equ 0001h
PWM2CON_PWM2POL_LENGTH                   equ 0001h
PWM2CON_PWM2POL_MASK                     equ 0010h
PWM2CON_PWM2OUT_POSN                     equ 0005h
PWM2CON_PWM2OUT_POSITION                 equ 0005h
PWM2CON_PWM2OUT_SIZE                     equ 0001h
PWM2CON_PWM2OUT_LENGTH                   equ 0001h
PWM2CON_PWM2OUT_MASK                     equ 0020h
PWM2CON_PWM2OE_POSN                      equ 0006h
PWM2CON_PWM2OE_POSITION                  equ 0006h
PWM2CON_PWM2OE_SIZE                      equ 0001h
PWM2CON_PWM2OE_LENGTH                    equ 0001h
PWM2CON_PWM2OE_MASK                      equ 0040h
PWM2CON_PWM2EN_POSN                      equ 0007h
PWM2CON_PWM2EN_POSITION                  equ 0007h
PWM2CON_PWM2EN_SIZE                      equ 0001h
PWM2CON_PWM2EN_LENGTH                    equ 0001h
PWM2CON_PWM2EN_MASK                      equ 0080h
PWM2CON_MODE0_POSN                       equ 0002h
PWM2CON_MODE0_POSITION                   equ 0002h
PWM2CON_MODE0_SIZE                       equ 0001h
PWM2CON_MODE0_LENGTH                     equ 0001h
PWM2CON_MODE0_MASK                       equ 0004h
PWM2CON_MODE1_POSN                       equ 0003h
PWM2CON_MODE1_POSITION                   equ 0003h
PWM2CON_MODE1_SIZE                       equ 0001h
PWM2CON_MODE1_LENGTH                     equ 0001h
PWM2CON_MODE1_MASK                       equ 0008h

// Register: PWM2INTE
#define PWM2INTE PWM2INTE
PWM2INTE                                 equ 0DACh
// bitfield definitions
PWM2INTE_PRIE_POSN                       equ 0000h
PWM2INTE_PRIE_POSITION                   equ 0000h
PWM2INTE_PRIE_SIZE                       equ 0001h
PWM2INTE_PRIE_LENGTH                     equ 0001h
PWM2INTE_PRIE_MASK                       equ 0001h
PWM2INTE_DCIE_POSN                       equ 0001h
PWM2INTE_DCIE_POSITION                   equ 0001h
PWM2INTE_DCIE_SIZE                       equ 0001h
PWM2INTE_DCIE_LENGTH                     equ 0001h
PWM2INTE_DCIE_MASK                       equ 0002h
PWM2INTE_PHIE_POSN                       equ 0002h
PWM2INTE_PHIE_POSITION                   equ 0002h
PWM2INTE_PHIE_SIZE                       equ 0001h
PWM2INTE_PHIE_LENGTH                     equ 0001h
PWM2INTE_PHIE_MASK                       equ 0004h
PWM2INTE_OFIE_POSN                       equ 0003h
PWM2INTE_OFIE_POSITION                   equ 0003h
PWM2INTE_OFIE_SIZE                       equ 0001h
PWM2INTE_OFIE_LENGTH                     equ 0001h
PWM2INTE_OFIE_MASK                       equ 0008h
PWM2INTE_PWM2PRIE_POSN                   equ 0000h
PWM2INTE_PWM2PRIE_POSITION               equ 0000h
PWM2INTE_PWM2PRIE_SIZE                   equ 0001h
PWM2INTE_PWM2PRIE_LENGTH                 equ 0001h
PWM2INTE_PWM2PRIE_MASK                   equ 0001h
PWM2INTE_PWM2DCIE_POSN                   equ 0001h
PWM2INTE_PWM2DCIE_POSITION               equ 0001h
PWM2INTE_PWM2DCIE_SIZE                   equ 0001h
PWM2INTE_PWM2DCIE_LENGTH                 equ 0001h
PWM2INTE_PWM2DCIE_MASK                   equ 0002h
PWM2INTE_PWM2PHIE_POSN                   equ 0002h
PWM2INTE_PWM2PHIE_POSITION               equ 0002h
PWM2INTE_PWM2PHIE_SIZE                   equ 0001h
PWM2INTE_PWM2PHIE_LENGTH                 equ 0001h
PWM2INTE_PWM2PHIE_MASK                   equ 0004h
PWM2INTE_PWM2OFIE_POSN                   equ 0003h
PWM2INTE_PWM2OFIE_POSITION               equ 0003h
PWM2INTE_PWM2OFIE_SIZE                   equ 0001h
PWM2INTE_PWM2OFIE_LENGTH                 equ 0001h
PWM2INTE_PWM2OFIE_MASK                   equ 0008h

// Register: PWM2INTF
#define PWM2INTF PWM2INTF
PWM2INTF                                 equ 0DADh
// bitfield definitions
PWM2INTF_PRIF_POSN                       equ 0000h
PWM2INTF_PRIF_POSITION                   equ 0000h
PWM2INTF_PRIF_SIZE                       equ 0001h
PWM2INTF_PRIF_LENGTH                     equ 0001h
PWM2INTF_PRIF_MASK                       equ 0001h
PWM2INTF_DCIF_POSN                       equ 0001h
PWM2INTF_DCIF_POSITION                   equ 0001h
PWM2INTF_DCIF_SIZE                       equ 0001h
PWM2INTF_DCIF_LENGTH                     equ 0001h
PWM2INTF_DCIF_MASK                       equ 0002h
PWM2INTF_PHIF_POSN                       equ 0002h
PWM2INTF_PHIF_POSITION                   equ 0002h
PWM2INTF_PHIF_SIZE                       equ 0001h
PWM2INTF_PHIF_LENGTH                     equ 0001h
PWM2INTF_PHIF_MASK                       equ 0004h
PWM2INTF_OFIF_POSN                       equ 0003h
PWM2INTF_OFIF_POSITION                   equ 0003h
PWM2INTF_OFIF_SIZE                       equ 0001h
PWM2INTF_OFIF_LENGTH                     equ 0001h
PWM2INTF_OFIF_MASK                       equ 0008h
PWM2INTF_PWM2PRIF_POSN                   equ 0000h
PWM2INTF_PWM2PRIF_POSITION               equ 0000h
PWM2INTF_PWM2PRIF_SIZE                   equ 0001h
PWM2INTF_PWM2PRIF_LENGTH                 equ 0001h
PWM2INTF_PWM2PRIF_MASK                   equ 0001h
PWM2INTF_PWM2DCIF_POSN                   equ 0001h
PWM2INTF_PWM2DCIF_POSITION               equ 0001h
PWM2INTF_PWM2DCIF_SIZE                   equ 0001h
PWM2INTF_PWM2DCIF_LENGTH                 equ 0001h
PWM2INTF_PWM2DCIF_MASK                   equ 0002h
PWM2INTF_PWM2PHIF_POSN                   equ 0002h
PWM2INTF_PWM2PHIF_POSITION               equ 0002h
PWM2INTF_PWM2PHIF_SIZE                   equ 0001h
PWM2INTF_PWM2PHIF_LENGTH                 equ 0001h
PWM2INTF_PWM2PHIF_MASK                   equ 0004h
PWM2INTF_PWM2OFIF_POSN                   equ 0003h
PWM2INTF_PWM2OFIF_POSITION               equ 0003h
PWM2INTF_PWM2OFIF_SIZE                   equ 0001h
PWM2INTF_PWM2OFIF_LENGTH                 equ 0001h
PWM2INTF_PWM2OFIF_MASK                   equ 0008h

// Register: PWM2CLKCON
#define PWM2CLKCON PWM2CLKCON
PWM2CLKCON                               equ 0DAEh
// bitfield definitions
PWM2CLKCON_CS_POSN                       equ 0000h
PWM2CLKCON_CS_POSITION                   equ 0000h
PWM2CLKCON_CS_SIZE                       equ 0002h
PWM2CLKCON_CS_LENGTH                     equ 0002h
PWM2CLKCON_CS_MASK                       equ 0003h
PWM2CLKCON_PS_POSN                       equ 0004h
PWM2CLKCON_PS_POSITION                   equ 0004h
PWM2CLKCON_PS_SIZE                       equ 0003h
PWM2CLKCON_PS_LENGTH                     equ 0003h
PWM2CLKCON_PS_MASK                       equ 0070h
PWM2CLKCON_PWM2CS0_POSN                  equ 0000h
PWM2CLKCON_PWM2CS0_POSITION              equ 0000h
PWM2CLKCON_PWM2CS0_SIZE                  equ 0001h
PWM2CLKCON_PWM2CS0_LENGTH                equ 0001h
PWM2CLKCON_PWM2CS0_MASK                  equ 0001h
PWM2CLKCON_PWM2CS1_POSN                  equ 0001h
PWM2CLKCON_PWM2CS1_POSITION              equ 0001h
PWM2CLKCON_PWM2CS1_SIZE                  equ 0001h
PWM2CLKCON_PWM2CS1_LENGTH                equ 0001h
PWM2CLKCON_PWM2CS1_MASK                  equ 0002h
PWM2CLKCON_PWM2PS0_POSN                  equ 0004h
PWM2CLKCON_PWM2PS0_POSITION              equ 0004h
PWM2CLKCON_PWM2PS0_SIZE                  equ 0001h
PWM2CLKCON_PWM2PS0_LENGTH                equ 0001h
PWM2CLKCON_PWM2PS0_MASK                  equ 0010h
PWM2CLKCON_PWM2PS1_POSN                  equ 0005h
PWM2CLKCON_PWM2PS1_POSITION              equ 0005h
PWM2CLKCON_PWM2PS1_SIZE                  equ 0001h
PWM2CLKCON_PWM2PS1_LENGTH                equ 0001h
PWM2CLKCON_PWM2PS1_MASK                  equ 0020h
PWM2CLKCON_PWM2PS2_POSN                  equ 0006h
PWM2CLKCON_PWM2PS2_POSITION              equ 0006h
PWM2CLKCON_PWM2PS2_SIZE                  equ 0001h
PWM2CLKCON_PWM2PS2_LENGTH                equ 0001h
PWM2CLKCON_PWM2PS2_MASK                  equ 0040h
PWM2CLKCON_PWM2CS_POSN                   equ 0000h
PWM2CLKCON_PWM2CS_POSITION               equ 0000h
PWM2CLKCON_PWM2CS_SIZE                   equ 0003h
PWM2CLKCON_PWM2CS_LENGTH                 equ 0003h
PWM2CLKCON_PWM2CS_MASK                   equ 0007h
PWM2CLKCON_PWM2PS_POSN                   equ 0004h
PWM2CLKCON_PWM2PS_POSITION               equ 0004h
PWM2CLKCON_PWM2PS_SIZE                   equ 0003h
PWM2CLKCON_PWM2PS_LENGTH                 equ 0003h
PWM2CLKCON_PWM2PS_MASK                   equ 0070h
PWM2CLKCON_CS0_POSN                      equ 0000h
PWM2CLKCON_CS0_POSITION                  equ 0000h
PWM2CLKCON_CS0_SIZE                      equ 0001h
PWM2CLKCON_CS0_LENGTH                    equ 0001h
PWM2CLKCON_CS0_MASK                      equ 0001h
PWM2CLKCON_CS1_POSN                      equ 0001h
PWM2CLKCON_CS1_POSITION                  equ 0001h
PWM2CLKCON_CS1_SIZE                      equ 0001h
PWM2CLKCON_CS1_LENGTH                    equ 0001h
PWM2CLKCON_CS1_MASK                      equ 0002h
PWM2CLKCON_PS0_POSN                      equ 0004h
PWM2CLKCON_PS0_POSITION                  equ 0004h
PWM2CLKCON_PS0_SIZE                      equ 0001h
PWM2CLKCON_PS0_LENGTH                    equ 0001h
PWM2CLKCON_PS0_MASK                      equ 0010h
PWM2CLKCON_PS1_POSN                      equ 0005h
PWM2CLKCON_PS1_POSITION                  equ 0005h
PWM2CLKCON_PS1_SIZE                      equ 0001h
PWM2CLKCON_PS1_LENGTH                    equ 0001h
PWM2CLKCON_PS1_MASK                      equ 0020h
PWM2CLKCON_PS2_POSN                      equ 0006h
PWM2CLKCON_PS2_POSITION                  equ 0006h
PWM2CLKCON_PS2_SIZE                      equ 0001h
PWM2CLKCON_PS2_LENGTH                    equ 0001h
PWM2CLKCON_PS2_MASK                      equ 0040h

// Register: PWM2LDCON
#define PWM2LDCON PWM2LDCON
PWM2LDCON                                equ 0DAFh
// bitfield definitions
PWM2LDCON_LDS_POSN                       equ 0000h
PWM2LDCON_LDS_POSITION                   equ 0000h
PWM2LDCON_LDS_SIZE                       equ 0002h
PWM2LDCON_LDS_LENGTH                     equ 0002h
PWM2LDCON_LDS_MASK                       equ 0003h
PWM2LDCON_LDT_POSN                       equ 0006h
PWM2LDCON_LDT_POSITION                   equ 0006h
PWM2LDCON_LDT_SIZE                       equ 0001h
PWM2LDCON_LDT_LENGTH                     equ 0001h
PWM2LDCON_LDT_MASK                       equ 0040h
PWM2LDCON_LDA_POSN                       equ 0007h
PWM2LDCON_LDA_POSITION                   equ 0007h
PWM2LDCON_LDA_SIZE                       equ 0001h
PWM2LDCON_LDA_LENGTH                     equ 0001h
PWM2LDCON_LDA_MASK                       equ 0080h
PWM2LDCON_PWM2LDS0_POSN                  equ 0000h
PWM2LDCON_PWM2LDS0_POSITION              equ 0000h
PWM2LDCON_PWM2LDS0_SIZE                  equ 0001h
PWM2LDCON_PWM2LDS0_LENGTH                equ 0001h
PWM2LDCON_PWM2LDS0_MASK                  equ 0001h
PWM2LDCON_PWM2LDS1_POSN                  equ 0001h
PWM2LDCON_PWM2LDS1_POSITION              equ 0001h
PWM2LDCON_PWM2LDS1_SIZE                  equ 0001h
PWM2LDCON_PWM2LDS1_LENGTH                equ 0001h
PWM2LDCON_PWM2LDS1_MASK                  equ 0002h
PWM2LDCON_PWM2LDS_POSN                   equ 0000h
PWM2LDCON_PWM2LDS_POSITION               equ 0000h
PWM2LDCON_PWM2LDS_SIZE                   equ 0002h
PWM2LDCON_PWM2LDS_LENGTH                 equ 0002h
PWM2LDCON_PWM2LDS_MASK                   equ 0003h
PWM2LDCON_PWM2LDM_POSN                   equ 0006h
PWM2LDCON_PWM2LDM_POSITION               equ 0006h
PWM2LDCON_PWM2LDM_SIZE                   equ 0001h
PWM2LDCON_PWM2LDM_LENGTH                 equ 0001h
PWM2LDCON_PWM2LDM_MASK                   equ 0040h
PWM2LDCON_PWM2LD_POSN                    equ 0007h
PWM2LDCON_PWM2LD_POSITION                equ 0007h
PWM2LDCON_PWM2LD_SIZE                    equ 0001h
PWM2LDCON_PWM2LD_LENGTH                  equ 0001h
PWM2LDCON_PWM2LD_MASK                    equ 0080h
PWM2LDCON_LDS0_POSN                      equ 0000h
PWM2LDCON_LDS0_POSITION                  equ 0000h
PWM2LDCON_LDS0_SIZE                      equ 0001h
PWM2LDCON_LDS0_LENGTH                    equ 0001h
PWM2LDCON_LDS0_MASK                      equ 0001h
PWM2LDCON_LDS1_POSN                      equ 0001h
PWM2LDCON_LDS1_POSITION                  equ 0001h
PWM2LDCON_LDS1_SIZE                      equ 0001h
PWM2LDCON_LDS1_LENGTH                    equ 0001h
PWM2LDCON_LDS1_MASK                      equ 0002h

