GopalSaraf/Practicals/PSDL/include/proc/pic16lf1575.inc
// Register: PWM2OFCON
#define PWM2OFCON PWM2OFCON
PWM2OFCON                                equ 0DB0h
// bitfield definitions
PWM2OFCON_OFS_POSN                       equ 0000h
PWM2OFCON_OFS_POSITION                   equ 0000h
PWM2OFCON_OFS_SIZE                       equ 0002h
PWM2OFCON_OFS_LENGTH                     equ 0002h
PWM2OFCON_OFS_MASK                       equ 0003h
PWM2OFCON_OFO_POSN                       equ 0004h
PWM2OFCON_OFO_POSITION                   equ 0004h
PWM2OFCON_OFO_SIZE                       equ 0001h
PWM2OFCON_OFO_LENGTH                     equ 0001h
PWM2OFCON_OFO_MASK                       equ 0010h
PWM2OFCON_OFM_POSN                       equ 0005h
PWM2OFCON_OFM_POSITION                   equ 0005h
PWM2OFCON_OFM_SIZE                       equ 0002h
PWM2OFCON_OFM_LENGTH                     equ 0002h
PWM2OFCON_OFM_MASK                       equ 0060h
PWM2OFCON_PWM2OFS0_POSN                  equ 0000h
PWM2OFCON_PWM2OFS0_POSITION              equ 0000h
PWM2OFCON_PWM2OFS0_SIZE                  equ 0001h
PWM2OFCON_PWM2OFS0_LENGTH                equ 0001h
PWM2OFCON_PWM2OFS0_MASK                  equ 0001h
PWM2OFCON_PWM2OFS1_POSN                  equ 0001h
PWM2OFCON_PWM2OFS1_POSITION              equ 0001h
PWM2OFCON_PWM2OFS1_SIZE                  equ 0001h
PWM2OFCON_PWM2OFS1_LENGTH                equ 0001h
PWM2OFCON_PWM2OFS1_MASK                  equ 0002h
PWM2OFCON_PWM2OFM0_POSN                  equ 0005h
PWM2OFCON_PWM2OFM0_POSITION              equ 0005h
PWM2OFCON_PWM2OFM0_SIZE                  equ 0001h
PWM2OFCON_PWM2OFM0_LENGTH                equ 0001h
PWM2OFCON_PWM2OFM0_MASK                  equ 0020h
PWM2OFCON_PWM2OFM1_POSN                  equ 0006h
PWM2OFCON_PWM2OFM1_POSITION              equ 0006h
PWM2OFCON_PWM2OFM1_SIZE                  equ 0001h
PWM2OFCON_PWM2OFM1_LENGTH                equ 0001h
PWM2OFCON_PWM2OFM1_MASK                  equ 0040h
PWM2OFCON_PWM2OFS_POSN                   equ 0000h
PWM2OFCON_PWM2OFS_POSITION               equ 0000h
PWM2OFCON_PWM2OFS_SIZE                   equ 0002h
PWM2OFCON_PWM2OFS_LENGTH                 equ 0002h
PWM2OFCON_PWM2OFS_MASK                   equ 0003h
PWM2OFCON_PWM2OFMC_POSN                  equ 0004h
PWM2OFCON_PWM2OFMC_POSITION              equ 0004h
PWM2OFCON_PWM2OFMC_SIZE                  equ 0001h
PWM2OFCON_PWM2OFMC_LENGTH                equ 0001h
PWM2OFCON_PWM2OFMC_MASK                  equ 0010h
PWM2OFCON_PWM2OFM_POSN                   equ 0005h
PWM2OFCON_PWM2OFM_POSITION               equ 0005h
PWM2OFCON_PWM2OFM_SIZE                   equ 0002h
PWM2OFCON_PWM2OFM_LENGTH                 equ 0002h
PWM2OFCON_PWM2OFM_MASK                   equ 0060h
PWM2OFCON_OFS0_POSN                      equ 0000h
PWM2OFCON_OFS0_POSITION                  equ 0000h
PWM2OFCON_OFS0_SIZE                      equ 0001h
PWM2OFCON_OFS0_LENGTH                    equ 0001h
PWM2OFCON_OFS0_MASK                      equ 0001h
PWM2OFCON_OFS1_POSN                      equ 0001h
PWM2OFCON_OFS1_POSITION                  equ 0001h
PWM2OFCON_OFS1_SIZE                      equ 0001h
PWM2OFCON_OFS1_LENGTH                    equ 0001h
PWM2OFCON_OFS1_MASK                      equ 0002h
PWM2OFCON_OFM0_POSN                      equ 0005h
PWM2OFCON_OFM0_POSITION                  equ 0005h
PWM2OFCON_OFM0_SIZE                      equ 0001h
PWM2OFCON_OFM0_LENGTH                    equ 0001h
PWM2OFCON_OFM0_MASK                      equ 0020h
PWM2OFCON_OFM1_POSN                      equ 0006h
PWM2OFCON_OFM1_POSITION                  equ 0006h
PWM2OFCON_OFM1_SIZE                      equ 0001h
PWM2OFCON_OFM1_LENGTH                    equ 0001h
PWM2OFCON_OFM1_MASK                      equ 0040h

// Register: PWM3PHL
#define PWM3PHL PWM3PHL
PWM3PHL                                  equ 0DB1h
// bitfield definitions
PWM3PHL_PH_POSN                          equ 0000h
PWM3PHL_PH_POSITION                      equ 0000h
PWM3PHL_PH_SIZE                          equ 0008h
PWM3PHL_PH_LENGTH                        equ 0008h
PWM3PHL_PH_MASK                          equ 00FFh
PWM3PHL_PWM3PHL0_POSN                    equ 0000h
PWM3PHL_PWM3PHL0_POSITION                equ 0000h
PWM3PHL_PWM3PHL0_SIZE                    equ 0001h
PWM3PHL_PWM3PHL0_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL0_MASK                    equ 0001h
PWM3PHL_PWM3PHL1_POSN                    equ 0001h
PWM3PHL_PWM3PHL1_POSITION                equ 0001h
PWM3PHL_PWM3PHL1_SIZE                    equ 0001h
PWM3PHL_PWM3PHL1_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL1_MASK                    equ 0002h
PWM3PHL_PWM3PHL2_POSN                    equ 0002h
PWM3PHL_PWM3PHL2_POSITION                equ 0002h
PWM3PHL_PWM3PHL2_SIZE                    equ 0001h
PWM3PHL_PWM3PHL2_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL2_MASK                    equ 0004h
PWM3PHL_PWM3PHL3_POSN                    equ 0003h
PWM3PHL_PWM3PHL3_POSITION                equ 0003h
PWM3PHL_PWM3PHL3_SIZE                    equ 0001h
PWM3PHL_PWM3PHL3_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL3_MASK                    equ 0008h
PWM3PHL_PWM3PHL4_POSN                    equ 0004h
PWM3PHL_PWM3PHL4_POSITION                equ 0004h
PWM3PHL_PWM3PHL4_SIZE                    equ 0001h
PWM3PHL_PWM3PHL4_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL4_MASK                    equ 0010h
PWM3PHL_PWM3PHL5_POSN                    equ 0005h
PWM3PHL_PWM3PHL5_POSITION                equ 0005h
PWM3PHL_PWM3PHL5_SIZE                    equ 0001h
PWM3PHL_PWM3PHL5_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL5_MASK                    equ 0020h
PWM3PHL_PWM3PHL6_POSN                    equ 0006h
PWM3PHL_PWM3PHL6_POSITION                equ 0006h
PWM3PHL_PWM3PHL6_SIZE                    equ 0001h
PWM3PHL_PWM3PHL6_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL6_MASK                    equ 0040h
PWM3PHL_PWM3PHL7_POSN                    equ 0007h
PWM3PHL_PWM3PHL7_POSITION                equ 0007h
PWM3PHL_PWM3PHL7_SIZE                    equ 0001h
PWM3PHL_PWM3PHL7_LENGTH                  equ 0001h
PWM3PHL_PWM3PHL7_MASK                    equ 0080h
PWM3PHL_PWM3PHL_POSN                     equ 0000h
PWM3PHL_PWM3PHL_POSITION                 equ 0000h
PWM3PHL_PWM3PHL_SIZE                     equ 0008h
PWM3PHL_PWM3PHL_LENGTH                   equ 0008h
PWM3PHL_PWM3PHL_MASK                     equ 00FFh

// Register: PWM3PHH
#define PWM3PHH PWM3PHH
PWM3PHH                                  equ 0DB2h
// bitfield definitions
PWM3PHH_PH_POSN                          equ 0000h
PWM3PHH_PH_POSITION                      equ 0000h
PWM3PHH_PH_SIZE                          equ 0008h
PWM3PHH_PH_LENGTH                        equ 0008h
PWM3PHH_PH_MASK                          equ 00FFh
PWM3PHH_PWM3PHH0_POSN                    equ 0000h
PWM3PHH_PWM3PHH0_POSITION                equ 0000h
PWM3PHH_PWM3PHH0_SIZE                    equ 0001h
PWM3PHH_PWM3PHH0_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH0_MASK                    equ 0001h
PWM3PHH_PWM3PHH1_POSN                    equ 0001h
PWM3PHH_PWM3PHH1_POSITION                equ 0001h
PWM3PHH_PWM3PHH1_SIZE                    equ 0001h
PWM3PHH_PWM3PHH1_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH1_MASK                    equ 0002h
PWM3PHH_PWM3PHH2_POSN                    equ 0002h
PWM3PHH_PWM3PHH2_POSITION                equ 0002h
PWM3PHH_PWM3PHH2_SIZE                    equ 0001h
PWM3PHH_PWM3PHH2_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH2_MASK                    equ 0004h
PWM3PHH_PWM3PHH3_POSN                    equ 0003h
PWM3PHH_PWM3PHH3_POSITION                equ 0003h
PWM3PHH_PWM3PHH3_SIZE                    equ 0001h
PWM3PHH_PWM3PHH3_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH3_MASK                    equ 0008h
PWM3PHH_PWM3PHH4_POSN                    equ 0004h
PWM3PHH_PWM3PHH4_POSITION                equ 0004h
PWM3PHH_PWM3PHH4_SIZE                    equ 0001h
PWM3PHH_PWM3PHH4_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH4_MASK                    equ 0010h
PWM3PHH_PWM3PHH5_POSN                    equ 0005h
PWM3PHH_PWM3PHH5_POSITION                equ 0005h
PWM3PHH_PWM3PHH5_SIZE                    equ 0001h
PWM3PHH_PWM3PHH5_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH5_MASK                    equ 0020h
PWM3PHH_PWM3PHH6_POSN                    equ 0006h
PWM3PHH_PWM3PHH6_POSITION                equ 0006h
PWM3PHH_PWM3PHH6_SIZE                    equ 0001h
PWM3PHH_PWM3PHH6_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH6_MASK                    equ 0040h
PWM3PHH_PWM3PHH7_POSN                    equ 0007h
PWM3PHH_PWM3PHH7_POSITION                equ 0007h
PWM3PHH_PWM3PHH7_SIZE                    equ 0001h
PWM3PHH_PWM3PHH7_LENGTH                  equ 0001h
PWM3PHH_PWM3PHH7_MASK                    equ 0080h
PWM3PHH_PWM3PHH_POSN                     equ 0000h
PWM3PHH_PWM3PHH_POSITION                 equ 0000h
PWM3PHH_PWM3PHH_SIZE                     equ 0008h
PWM3PHH_PWM3PHH_LENGTH                   equ 0008h
PWM3PHH_PWM3PHH_MASK                     equ 00FFh

