GopalSaraf/Practicals/PSDL/include/proc/pic16lf1575.inc
// Register: PWM3DCL
#define PWM3DCL PWM3DCL
PWM3DCL                                  equ 0DB3h
// bitfield definitions
PWM3DCL_DC_POSN                          equ 0000h
PWM3DCL_DC_POSITION                      equ 0000h
PWM3DCL_DC_SIZE                          equ 0008h
PWM3DCL_DC_LENGTH                        equ 0008h
PWM3DCL_DC_MASK                          equ 00FFh
PWM3DCL_PWM3DCL0_POSN                    equ 0000h
PWM3DCL_PWM3DCL0_POSITION                equ 0000h
PWM3DCL_PWM3DCL0_SIZE                    equ 0001h
PWM3DCL_PWM3DCL0_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL0_MASK                    equ 0001h
PWM3DCL_PWM3DCL1_POSN                    equ 0001h
PWM3DCL_PWM3DCL1_POSITION                equ 0001h
PWM3DCL_PWM3DCL1_SIZE                    equ 0001h
PWM3DCL_PWM3DCL1_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL1_MASK                    equ 0002h
PWM3DCL_PWM3DCL2_POSN                    equ 0002h
PWM3DCL_PWM3DCL2_POSITION                equ 0002h
PWM3DCL_PWM3DCL2_SIZE                    equ 0001h
PWM3DCL_PWM3DCL2_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL2_MASK                    equ 0004h
PWM3DCL_PWM3DCL3_POSN                    equ 0003h
PWM3DCL_PWM3DCL3_POSITION                equ 0003h
PWM3DCL_PWM3DCL3_SIZE                    equ 0001h
PWM3DCL_PWM3DCL3_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL3_MASK                    equ 0008h
PWM3DCL_PWM3DCL4_POSN                    equ 0004h
PWM3DCL_PWM3DCL4_POSITION                equ 0004h
PWM3DCL_PWM3DCL4_SIZE                    equ 0001h
PWM3DCL_PWM3DCL4_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL4_MASK                    equ 0010h
PWM3DCL_PWM3DCL5_POSN                    equ 0005h
PWM3DCL_PWM3DCL5_POSITION                equ 0005h
PWM3DCL_PWM3DCL5_SIZE                    equ 0001h
PWM3DCL_PWM3DCL5_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL5_MASK                    equ 0020h
PWM3DCL_PWM3DCL6_POSN                    equ 0006h
PWM3DCL_PWM3DCL6_POSITION                equ 0006h
PWM3DCL_PWM3DCL6_SIZE                    equ 0001h
PWM3DCL_PWM3DCL6_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL6_MASK                    equ 0040h
PWM3DCL_PWM3DCL7_POSN                    equ 0007h
PWM3DCL_PWM3DCL7_POSITION                equ 0007h
PWM3DCL_PWM3DCL7_SIZE                    equ 0001h
PWM3DCL_PWM3DCL7_LENGTH                  equ 0001h
PWM3DCL_PWM3DCL7_MASK                    equ 0080h
PWM3DCL_PWM3DCL_POSN                     equ 0000h
PWM3DCL_PWM3DCL_POSITION                 equ 0000h
PWM3DCL_PWM3DCL_SIZE                     equ 0008h
PWM3DCL_PWM3DCL_LENGTH                   equ 0008h
PWM3DCL_PWM3DCL_MASK                     equ 00FFh

// Register: PWM3DCH
#define PWM3DCH PWM3DCH
PWM3DCH                                  equ 0DB4h
// bitfield definitions
PWM3DCH_DC_POSN                          equ 0000h
PWM3DCH_DC_POSITION                      equ 0000h
PWM3DCH_DC_SIZE                          equ 0008h
PWM3DCH_DC_LENGTH                        equ 0008h
PWM3DCH_DC_MASK                          equ 00FFh
PWM3DCH_PWM3DCH0_POSN                    equ 0000h
PWM3DCH_PWM3DCH0_POSITION                equ 0000h
PWM3DCH_PWM3DCH0_SIZE                    equ 0001h
PWM3DCH_PWM3DCH0_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH0_MASK                    equ 0001h
PWM3DCH_PWM3DCH1_POSN                    equ 0001h
PWM3DCH_PWM3DCH1_POSITION                equ 0001h
PWM3DCH_PWM3DCH1_SIZE                    equ 0001h
PWM3DCH_PWM3DCH1_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH1_MASK                    equ 0002h
PWM3DCH_PWM3DCH2_POSN                    equ 0002h
PWM3DCH_PWM3DCH2_POSITION                equ 0002h
PWM3DCH_PWM3DCH2_SIZE                    equ 0001h
PWM3DCH_PWM3DCH2_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH2_MASK                    equ 0004h
PWM3DCH_PWM3DCH3_POSN                    equ 0003h
PWM3DCH_PWM3DCH3_POSITION                equ 0003h
PWM3DCH_PWM3DCH3_SIZE                    equ 0001h
PWM3DCH_PWM3DCH3_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH3_MASK                    equ 0008h
PWM3DCH_PWM3DCH4_POSN                    equ 0004h
PWM3DCH_PWM3DCH4_POSITION                equ 0004h
PWM3DCH_PWM3DCH4_SIZE                    equ 0001h
PWM3DCH_PWM3DCH4_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH4_MASK                    equ 0010h
PWM3DCH_PWM3DCH5_POSN                    equ 0005h
PWM3DCH_PWM3DCH5_POSITION                equ 0005h
PWM3DCH_PWM3DCH5_SIZE                    equ 0001h
PWM3DCH_PWM3DCH5_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH5_MASK                    equ 0020h
PWM3DCH_PWM3DCH6_POSN                    equ 0006h
PWM3DCH_PWM3DCH6_POSITION                equ 0006h
PWM3DCH_PWM3DCH6_SIZE                    equ 0001h
PWM3DCH_PWM3DCH6_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH6_MASK                    equ 0040h
PWM3DCH_PWM3DCH7_POSN                    equ 0007h
PWM3DCH_PWM3DCH7_POSITION                equ 0007h
PWM3DCH_PWM3DCH7_SIZE                    equ 0001h
PWM3DCH_PWM3DCH7_LENGTH                  equ 0001h
PWM3DCH_PWM3DCH7_MASK                    equ 0080h
PWM3DCH_PWM3DCH_POSN                     equ 0000h
PWM3DCH_PWM3DCH_POSITION                 equ 0000h
PWM3DCH_PWM3DCH_SIZE                     equ 0008h
PWM3DCH_PWM3DCH_LENGTH                   equ 0008h
PWM3DCH_PWM3DCH_MASK                     equ 00FFh

// Register: PWM3PRL
#define PWM3PRL PWM3PRL
PWM3PRL                                  equ 0DB5h
// bitfield definitions
PWM3PRL_PR_POSN                          equ 0000h
PWM3PRL_PR_POSITION                      equ 0000h
PWM3PRL_PR_SIZE                          equ 0008h
PWM3PRL_PR_LENGTH                        equ 0008h
PWM3PRL_PR_MASK                          equ 00FFh
PWM3PRL_PWM3PRL0_POSN                    equ 0000h
PWM3PRL_PWM3PRL0_POSITION                equ 0000h
PWM3PRL_PWM3PRL0_SIZE                    equ 0001h
PWM3PRL_PWM3PRL0_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL0_MASK                    equ 0001h
PWM3PRL_PWM3PRL1_POSN                    equ 0001h
PWM3PRL_PWM3PRL1_POSITION                equ 0001h
PWM3PRL_PWM3PRL1_SIZE                    equ 0001h
PWM3PRL_PWM3PRL1_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL1_MASK                    equ 0002h
PWM3PRL_PWM3PRL2_POSN                    equ 0002h
PWM3PRL_PWM3PRL2_POSITION                equ 0002h
PWM3PRL_PWM3PRL2_SIZE                    equ 0001h
PWM3PRL_PWM3PRL2_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL2_MASK                    equ 0004h
PWM3PRL_PWM3PRL3_POSN                    equ 0003h
PWM3PRL_PWM3PRL3_POSITION                equ 0003h
PWM3PRL_PWM3PRL3_SIZE                    equ 0001h
PWM3PRL_PWM3PRL3_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL3_MASK                    equ 0008h
PWM3PRL_PWM3PRL4_POSN                    equ 0004h
PWM3PRL_PWM3PRL4_POSITION                equ 0004h
PWM3PRL_PWM3PRL4_SIZE                    equ 0001h
PWM3PRL_PWM3PRL4_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL4_MASK                    equ 0010h
PWM3PRL_PWM3PRL5_POSN                    equ 0005h
PWM3PRL_PWM3PRL5_POSITION                equ 0005h
PWM3PRL_PWM3PRL5_SIZE                    equ 0001h
PWM3PRL_PWM3PRL5_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL5_MASK                    equ 0020h
PWM3PRL_PWM3PRL6_POSN                    equ 0006h
PWM3PRL_PWM3PRL6_POSITION                equ 0006h
PWM3PRL_PWM3PRL6_SIZE                    equ 0001h
PWM3PRL_PWM3PRL6_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL6_MASK                    equ 0040h
PWM3PRL_PWM3PRL7_POSN                    equ 0007h
PWM3PRL_PWM3PRL7_POSITION                equ 0007h
PWM3PRL_PWM3PRL7_SIZE                    equ 0001h
PWM3PRL_PWM3PRL7_LENGTH                  equ 0001h
PWM3PRL_PWM3PRL7_MASK                    equ 0080h
PWM3PRL_PWM3PRL_POSN                     equ 0000h
PWM3PRL_PWM3PRL_POSITION                 equ 0000h
PWM3PRL_PWM3PRL_SIZE                     equ 0008h
PWM3PRL_PWM3PRL_LENGTH                   equ 0008h
PWM3PRL_PWM3PRL_MASK                     equ 00FFh

// Register: PWM3PRH
#define PWM3PRH PWM3PRH
PWM3PRH                                  equ 0DB6h
// bitfield definitions
PWM3PRH_PR_POSN                          equ 0000h
PWM3PRH_PR_POSITION                      equ 0000h
PWM3PRH_PR_SIZE                          equ 0008h
PWM3PRH_PR_LENGTH                        equ 0008h
PWM3PRH_PR_MASK                          equ 00FFh
PWM3PRH_PWM3PRH0_POSN                    equ 0000h
PWM3PRH_PWM3PRH0_POSITION                equ 0000h
PWM3PRH_PWM3PRH0_SIZE                    equ 0001h
PWM3PRH_PWM3PRH0_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH0_MASK                    equ 0001h
PWM3PRH_PWM3PRH1_POSN                    equ 0001h
PWM3PRH_PWM3PRH1_POSITION                equ 0001h
PWM3PRH_PWM3PRH1_SIZE                    equ 0001h
PWM3PRH_PWM3PRH1_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH1_MASK                    equ 0002h
PWM3PRH_PWM3PRH2_POSN                    equ 0002h
PWM3PRH_PWM3PRH2_POSITION                equ 0002h
PWM3PRH_PWM3PRH2_SIZE                    equ 0001h
PWM3PRH_PWM3PRH2_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH2_MASK                    equ 0004h
PWM3PRH_PWM3PRH3_POSN                    equ 0003h
PWM3PRH_PWM3PRH3_POSITION                equ 0003h
PWM3PRH_PWM3PRH3_SIZE                    equ 0001h
PWM3PRH_PWM3PRH3_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH3_MASK                    equ 0008h
PWM3PRH_PWM3PRH4_POSN                    equ 0004h
PWM3PRH_PWM3PRH4_POSITION                equ 0004h
PWM3PRH_PWM3PRH4_SIZE                    equ 0001h
PWM3PRH_PWM3PRH4_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH4_MASK                    equ 0010h
PWM3PRH_PWM3PRH5_POSN                    equ 0005h
PWM3PRH_PWM3PRH5_POSITION                equ 0005h
PWM3PRH_PWM3PRH5_SIZE                    equ 0001h
PWM3PRH_PWM3PRH5_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH5_MASK                    equ 0020h
PWM3PRH_PWM3PRH6_POSN                    equ 0006h
PWM3PRH_PWM3PRH6_POSITION                equ 0006h
PWM3PRH_PWM3PRH6_SIZE                    equ 0001h
PWM3PRH_PWM3PRH6_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH6_MASK                    equ 0040h
PWM3PRH_PWM3PRH7_POSN                    equ 0007h
PWM3PRH_PWM3PRH7_POSITION                equ 0007h
PWM3PRH_PWM3PRH7_SIZE                    equ 0001h
PWM3PRH_PWM3PRH7_LENGTH                  equ 0001h
PWM3PRH_PWM3PRH7_MASK                    equ 0080h
PWM3PRH_PWM3PRH_POSN                     equ 0000h
PWM3PRH_PWM3PRH_POSITION                 equ 0000h
PWM3PRH_PWM3PRH_SIZE                     equ 0008h
PWM3PRH_PWM3PRH_LENGTH                   equ 0008h
PWM3PRH_PWM3PRH_MASK                     equ 00FFh

