GopalSaraf/Practicals/PSDL/include/proc/pic16lf1575.inc
// Register: PWM3LDCON
#define PWM3LDCON PWM3LDCON
PWM3LDCON                                equ 0DBFh
// bitfield definitions
PWM3LDCON_LDS_POSN                       equ 0000h
PWM3LDCON_LDS_POSITION                   equ 0000h
PWM3LDCON_LDS_SIZE                       equ 0002h
PWM3LDCON_LDS_LENGTH                     equ 0002h
PWM3LDCON_LDS_MASK                       equ 0003h
PWM3LDCON_LDT_POSN                       equ 0006h
PWM3LDCON_LDT_POSITION                   equ 0006h
PWM3LDCON_LDT_SIZE                       equ 0001h
PWM3LDCON_LDT_LENGTH                     equ 0001h
PWM3LDCON_LDT_MASK                       equ 0040h
PWM3LDCON_LDA_POSN                       equ 0007h
PWM3LDCON_LDA_POSITION                   equ 0007h
PWM3LDCON_LDA_SIZE                       equ 0001h
PWM3LDCON_LDA_LENGTH                     equ 0001h
PWM3LDCON_LDA_MASK                       equ 0080h
PWM3LDCON_PWM3LDS0_POSN                  equ 0000h
PWM3LDCON_PWM3LDS0_POSITION              equ 0000h
PWM3LDCON_PWM3LDS0_SIZE                  equ 0001h
PWM3LDCON_PWM3LDS0_LENGTH                equ 0001h
PWM3LDCON_PWM3LDS0_MASK                  equ 0001h
PWM3LDCON_PWM3LDS1_POSN                  equ 0001h
PWM3LDCON_PWM3LDS1_POSITION              equ 0001h
PWM3LDCON_PWM3LDS1_SIZE                  equ 0001h
PWM3LDCON_PWM3LDS1_LENGTH                equ 0001h
PWM3LDCON_PWM3LDS1_MASK                  equ 0002h
PWM3LDCON_PWM3LDS_POSN                   equ 0000h
PWM3LDCON_PWM3LDS_POSITION               equ 0000h
PWM3LDCON_PWM3LDS_SIZE                   equ 0002h
PWM3LDCON_PWM3LDS_LENGTH                 equ 0002h
PWM3LDCON_PWM3LDS_MASK                   equ 0003h
PWM3LDCON_PWM3LDM_POSN                   equ 0006h
PWM3LDCON_PWM3LDM_POSITION               equ 0006h
PWM3LDCON_PWM3LDM_SIZE                   equ 0001h
PWM3LDCON_PWM3LDM_LENGTH                 equ 0001h
PWM3LDCON_PWM3LDM_MASK                   equ 0040h
PWM3LDCON_PWM3LD_POSN                    equ 0007h
PWM3LDCON_PWM3LD_POSITION                equ 0007h
PWM3LDCON_PWM3LD_SIZE                    equ 0001h
PWM3LDCON_PWM3LD_LENGTH                  equ 0001h
PWM3LDCON_PWM3LD_MASK                    equ 0080h
PWM3LDCON_LDS0_POSN                      equ 0000h
PWM3LDCON_LDS0_POSITION                  equ 0000h
PWM3LDCON_LDS0_SIZE                      equ 0001h
PWM3LDCON_LDS0_LENGTH                    equ 0001h
PWM3LDCON_LDS0_MASK                      equ 0001h
PWM3LDCON_LDS1_POSN                      equ 0001h
PWM3LDCON_LDS1_POSITION                  equ 0001h
PWM3LDCON_LDS1_SIZE                      equ 0001h
PWM3LDCON_LDS1_LENGTH                    equ 0001h
PWM3LDCON_LDS1_MASK                      equ 0002h

// Register: PWM3OFCON
#define PWM3OFCON PWM3OFCON
PWM3OFCON                                equ 0DC0h
// bitfield definitions
PWM3OFCON_OFS_POSN                       equ 0000h
PWM3OFCON_OFS_POSITION                   equ 0000h
PWM3OFCON_OFS_SIZE                       equ 0002h
PWM3OFCON_OFS_LENGTH                     equ 0002h
PWM3OFCON_OFS_MASK                       equ 0003h
PWM3OFCON_OFO_POSN                       equ 0004h
PWM3OFCON_OFO_POSITION                   equ 0004h
PWM3OFCON_OFO_SIZE                       equ 0001h
PWM3OFCON_OFO_LENGTH                     equ 0001h
PWM3OFCON_OFO_MASK                       equ 0010h
PWM3OFCON_OFM_POSN                       equ 0005h
PWM3OFCON_OFM_POSITION                   equ 0005h
PWM3OFCON_OFM_SIZE                       equ 0002h
PWM3OFCON_OFM_LENGTH                     equ 0002h
PWM3OFCON_OFM_MASK                       equ 0060h
PWM3OFCON_PWM3OFS0_POSN                  equ 0000h
PWM3OFCON_PWM3OFS0_POSITION              equ 0000h
PWM3OFCON_PWM3OFS0_SIZE                  equ 0001h
PWM3OFCON_PWM3OFS0_LENGTH                equ 0001h
PWM3OFCON_PWM3OFS0_MASK                  equ 0001h
PWM3OFCON_PWM3OFS1_POSN                  equ 0001h
PWM3OFCON_PWM3OFS1_POSITION              equ 0001h
PWM3OFCON_PWM3OFS1_SIZE                  equ 0001h
PWM3OFCON_PWM3OFS1_LENGTH                equ 0001h
PWM3OFCON_PWM3OFS1_MASK                  equ 0002h
PWM3OFCON_PWM3OFM0_POSN                  equ 0005h
PWM3OFCON_PWM3OFM0_POSITION              equ 0005h
PWM3OFCON_PWM3OFM0_SIZE                  equ 0001h
PWM3OFCON_PWM3OFM0_LENGTH                equ 0001h
PWM3OFCON_PWM3OFM0_MASK                  equ 0020h
PWM3OFCON_PWM3OFM1_POSN                  equ 0006h
PWM3OFCON_PWM3OFM1_POSITION              equ 0006h
PWM3OFCON_PWM3OFM1_SIZE                  equ 0001h
PWM3OFCON_PWM3OFM1_LENGTH                equ 0001h
PWM3OFCON_PWM3OFM1_MASK                  equ 0040h
PWM3OFCON_PWM3OFS_POSN                   equ 0000h
PWM3OFCON_PWM3OFS_POSITION               equ 0000h
PWM3OFCON_PWM3OFS_SIZE                   equ 0002h
PWM3OFCON_PWM3OFS_LENGTH                 equ 0002h
PWM3OFCON_PWM3OFS_MASK                   equ 0003h
PWM3OFCON_PWM3OFMC_POSN                  equ 0004h
PWM3OFCON_PWM3OFMC_POSITION              equ 0004h
PWM3OFCON_PWM3OFMC_SIZE                  equ 0001h
PWM3OFCON_PWM3OFMC_LENGTH                equ 0001h
PWM3OFCON_PWM3OFMC_MASK                  equ 0010h
PWM3OFCON_PWM3OFM_POSN                   equ 0005h
PWM3OFCON_PWM3OFM_POSITION               equ 0005h
PWM3OFCON_PWM3OFM_SIZE                   equ 0002h
PWM3OFCON_PWM3OFM_LENGTH                 equ 0002h
PWM3OFCON_PWM3OFM_MASK                   equ 0060h
PWM3OFCON_OFS0_POSN                      equ 0000h
PWM3OFCON_OFS0_POSITION                  equ 0000h
PWM3OFCON_OFS0_SIZE                      equ 0001h
PWM3OFCON_OFS0_LENGTH                    equ 0001h
PWM3OFCON_OFS0_MASK                      equ 0001h
PWM3OFCON_OFS1_POSN                      equ 0001h
PWM3OFCON_OFS1_POSITION                  equ 0001h
PWM3OFCON_OFS1_SIZE                      equ 0001h
PWM3OFCON_OFS1_LENGTH                    equ 0001h
PWM3OFCON_OFS1_MASK                      equ 0002h
PWM3OFCON_OFM0_POSN                      equ 0005h
PWM3OFCON_OFM0_POSITION                  equ 0005h
PWM3OFCON_OFM0_SIZE                      equ 0001h
PWM3OFCON_OFM0_LENGTH                    equ 0001h
PWM3OFCON_OFM0_MASK                      equ 0020h
PWM3OFCON_OFM1_POSN                      equ 0006h
PWM3OFCON_OFM1_POSITION                  equ 0006h
PWM3OFCON_OFM1_SIZE                      equ 0001h
PWM3OFCON_OFM1_LENGTH                    equ 0001h
PWM3OFCON_OFM1_MASK                      equ 0040h

// Register: PWM4PHL
#define PWM4PHL PWM4PHL
PWM4PHL                                  equ 0DC1h
// bitfield definitions
PWM4PHL_PH_POSN                          equ 0000h
PWM4PHL_PH_POSITION                      equ 0000h
PWM4PHL_PH_SIZE                          equ 0008h
PWM4PHL_PH_LENGTH                        equ 0008h
PWM4PHL_PH_MASK                          equ 00FFh
PWM4PHL_PWM4PHL0_POSN                    equ 0000h
PWM4PHL_PWM4PHL0_POSITION                equ 0000h
PWM4PHL_PWM4PHL0_SIZE                    equ 0001h
PWM4PHL_PWM4PHL0_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL0_MASK                    equ 0001h
PWM4PHL_PWM4PHL1_POSN                    equ 0001h
PWM4PHL_PWM4PHL1_POSITION                equ 0001h
PWM4PHL_PWM4PHL1_SIZE                    equ 0001h
PWM4PHL_PWM4PHL1_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL1_MASK                    equ 0002h
PWM4PHL_PWM4PHL2_POSN                    equ 0002h
PWM4PHL_PWM4PHL2_POSITION                equ 0002h
PWM4PHL_PWM4PHL2_SIZE                    equ 0001h
PWM4PHL_PWM4PHL2_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL2_MASK                    equ 0004h
PWM4PHL_PWM4PHL3_POSN                    equ 0003h
PWM4PHL_PWM4PHL3_POSITION                equ 0003h
PWM4PHL_PWM4PHL3_SIZE                    equ 0001h
PWM4PHL_PWM4PHL3_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL3_MASK                    equ 0008h
PWM4PHL_PWM4PHL4_POSN                    equ 0004h
PWM4PHL_PWM4PHL4_POSITION                equ 0004h
PWM4PHL_PWM4PHL4_SIZE                    equ 0001h
PWM4PHL_PWM4PHL4_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL4_MASK                    equ 0010h
PWM4PHL_PWM4PHL5_POSN                    equ 0005h
PWM4PHL_PWM4PHL5_POSITION                equ 0005h
PWM4PHL_PWM4PHL5_SIZE                    equ 0001h
PWM4PHL_PWM4PHL5_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL5_MASK                    equ 0020h
PWM4PHL_PWM4PHL6_POSN                    equ 0006h
PWM4PHL_PWM4PHL6_POSITION                equ 0006h
PWM4PHL_PWM4PHL6_SIZE                    equ 0001h
PWM4PHL_PWM4PHL6_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL6_MASK                    equ 0040h
PWM4PHL_PWM4PHL7_POSN                    equ 0007h
PWM4PHL_PWM4PHL7_POSITION                equ 0007h
PWM4PHL_PWM4PHL7_SIZE                    equ 0001h
PWM4PHL_PWM4PHL7_LENGTH                  equ 0001h
PWM4PHL_PWM4PHL7_MASK                    equ 0080h
PWM4PHL_PWM4PHL_POSN                     equ 0000h
PWM4PHL_PWM4PHL_POSITION                 equ 0000h
PWM4PHL_PWM4PHL_SIZE                     equ 0008h
PWM4PHL_PWM4PHL_LENGTH                   equ 0008h
PWM4PHL_PWM4PHL_MASK                     equ 00FFh

// Register: PWM4PHH
#define PWM4PHH PWM4PHH
PWM4PHH                                  equ 0DC2h
// bitfield definitions
PWM4PHH_PH_POSN                          equ 0000h
PWM4PHH_PH_POSITION                      equ 0000h
PWM4PHH_PH_SIZE                          equ 0008h
PWM4PHH_PH_LENGTH                        equ 0008h
PWM4PHH_PH_MASK                          equ 00FFh
PWM4PHH_PWM4PHH0_POSN                    equ 0000h
PWM4PHH_PWM4PHH0_POSITION                equ 0000h
PWM4PHH_PWM4PHH0_SIZE                    equ 0001h
PWM4PHH_PWM4PHH0_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH0_MASK                    equ 0001h
PWM4PHH_PWM4PHH1_POSN                    equ 0001h
PWM4PHH_PWM4PHH1_POSITION                equ 0001h
PWM4PHH_PWM4PHH1_SIZE                    equ 0001h
PWM4PHH_PWM4PHH1_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH1_MASK                    equ 0002h
PWM4PHH_PWM4PHH2_POSN                    equ 0002h
PWM4PHH_PWM4PHH2_POSITION                equ 0002h
PWM4PHH_PWM4PHH2_SIZE                    equ 0001h
PWM4PHH_PWM4PHH2_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH2_MASK                    equ 0004h
PWM4PHH_PWM4PHH3_POSN                    equ 0003h
PWM4PHH_PWM4PHH3_POSITION                equ 0003h
PWM4PHH_PWM4PHH3_SIZE                    equ 0001h
PWM4PHH_PWM4PHH3_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH3_MASK                    equ 0008h
PWM4PHH_PWM4PHH4_POSN                    equ 0004h
PWM4PHH_PWM4PHH4_POSITION                equ 0004h
PWM4PHH_PWM4PHH4_SIZE                    equ 0001h
PWM4PHH_PWM4PHH4_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH4_MASK                    equ 0010h
PWM4PHH_PWM4PHH5_POSN                    equ 0005h
PWM4PHH_PWM4PHH5_POSITION                equ 0005h
PWM4PHH_PWM4PHH5_SIZE                    equ 0001h
PWM4PHH_PWM4PHH5_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH5_MASK                    equ 0020h
PWM4PHH_PWM4PHH6_POSN                    equ 0006h
PWM4PHH_PWM4PHH6_POSITION                equ 0006h
PWM4PHH_PWM4PHH6_SIZE                    equ 0001h
PWM4PHH_PWM4PHH6_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH6_MASK                    equ 0040h
PWM4PHH_PWM4PHH7_POSN                    equ 0007h
PWM4PHH_PWM4PHH7_POSITION                equ 0007h
PWM4PHH_PWM4PHH7_SIZE                    equ 0001h
PWM4PHH_PWM4PHH7_LENGTH                  equ 0001h
PWM4PHH_PWM4PHH7_MASK                    equ 0080h
PWM4PHH_PWM4PHH_POSN                     equ 0000h
PWM4PHH_PWM4PHH_POSITION                 equ 0000h
PWM4PHH_PWM4PHH_SIZE                     equ 0008h
PWM4PHH_PWM4PHH_LENGTH                   equ 0008h
PWM4PHH_PWM4PHH_MASK                     equ 00FFh

// Register: PWM4DCL
#define PWM4DCL PWM4DCL
PWM4DCL                                  equ 0DC3h
// bitfield definitions
PWM4DCL_DC_POSN                          equ 0000h
PWM4DCL_DC_POSITION                      equ 0000h
PWM4DCL_DC_SIZE                          equ 0008h
PWM4DCL_DC_LENGTH                        equ 0008h
PWM4DCL_DC_MASK                          equ 00FFh
PWM4DCL_PWM4DCL0_POSN                    equ 0000h
PWM4DCL_PWM4DCL0_POSITION                equ 0000h
PWM4DCL_PWM4DCL0_SIZE                    equ 0001h
PWM4DCL_PWM4DCL0_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL0_MASK                    equ 0001h
PWM4DCL_PWM4DCL1_POSN                    equ 0001h
PWM4DCL_PWM4DCL1_POSITION                equ 0001h
PWM4DCL_PWM4DCL1_SIZE                    equ 0001h
PWM4DCL_PWM4DCL1_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL1_MASK                    equ 0002h
PWM4DCL_PWM4DCL2_POSN                    equ 0002h
PWM4DCL_PWM4DCL2_POSITION                equ 0002h
PWM4DCL_PWM4DCL2_SIZE                    equ 0001h
PWM4DCL_PWM4DCL2_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL2_MASK                    equ 0004h
PWM4DCL_PWM4DCL3_POSN                    equ 0003h
PWM4DCL_PWM4DCL3_POSITION                equ 0003h
PWM4DCL_PWM4DCL3_SIZE                    equ 0001h
PWM4DCL_PWM4DCL3_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL3_MASK                    equ 0008h
PWM4DCL_PWM4DCL4_POSN                    equ 0004h
PWM4DCL_PWM4DCL4_POSITION                equ 0004h
PWM4DCL_PWM4DCL4_SIZE                    equ 0001h
PWM4DCL_PWM4DCL4_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL4_MASK                    equ 0010h
PWM4DCL_PWM4DCL5_POSN                    equ 0005h
PWM4DCL_PWM4DCL5_POSITION                equ 0005h
PWM4DCL_PWM4DCL5_SIZE                    equ 0001h
PWM4DCL_PWM4DCL5_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL5_MASK                    equ 0020h
PWM4DCL_PWM4DCL6_POSN                    equ 0006h
PWM4DCL_PWM4DCL6_POSITION                equ 0006h
PWM4DCL_PWM4DCL6_SIZE                    equ 0001h
PWM4DCL_PWM4DCL6_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL6_MASK                    equ 0040h
PWM4DCL_PWM4DCL7_POSN                    equ 0007h
PWM4DCL_PWM4DCL7_POSITION                equ 0007h
PWM4DCL_PWM4DCL7_SIZE                    equ 0001h
PWM4DCL_PWM4DCL7_LENGTH                  equ 0001h
PWM4DCL_PWM4DCL7_MASK                    equ 0080h
PWM4DCL_PWM4DCL_POSN                     equ 0000h
PWM4DCL_PWM4DCL_POSITION                 equ 0000h
PWM4DCL_PWM4DCL_SIZE                     equ 0008h
PWM4DCL_PWM4DCL_LENGTH                   equ 0008h
PWM4DCL_PWM4DCL_MASK                     equ 00FFh

