GopalSaraf/Practicals/PSDL/include/proc/pic16lf1575.inc
// Register: PWM4OFH
#define PWM4OFH PWM4OFH
PWM4OFH                                  equ 0DC8h
// bitfield definitions
PWM4OFH_OF_POSN                          equ 0000h
PWM4OFH_OF_POSITION                      equ 0000h
PWM4OFH_OF_SIZE                          equ 0008h
PWM4OFH_OF_LENGTH                        equ 0008h
PWM4OFH_OF_MASK                          equ 00FFh
PWM4OFH_PWM4OFH0_POSN                    equ 0000h
PWM4OFH_PWM4OFH0_POSITION                equ 0000h
PWM4OFH_PWM4OFH0_SIZE                    equ 0001h
PWM4OFH_PWM4OFH0_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH0_MASK                    equ 0001h
PWM4OFH_PWM4OFH1_POSN                    equ 0001h
PWM4OFH_PWM4OFH1_POSITION                equ 0001h
PWM4OFH_PWM4OFH1_SIZE                    equ 0001h
PWM4OFH_PWM4OFH1_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH1_MASK                    equ 0002h
PWM4OFH_PWM4OFH2_POSN                    equ 0002h
PWM4OFH_PWM4OFH2_POSITION                equ 0002h
PWM4OFH_PWM4OFH2_SIZE                    equ 0001h
PWM4OFH_PWM4OFH2_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH2_MASK                    equ 0004h
PWM4OFH_PWM4OFH3_POSN                    equ 0003h
PWM4OFH_PWM4OFH3_POSITION                equ 0003h
PWM4OFH_PWM4OFH3_SIZE                    equ 0001h
PWM4OFH_PWM4OFH3_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH3_MASK                    equ 0008h
PWM4OFH_PWM4OFH4_POSN                    equ 0004h
PWM4OFH_PWM4OFH4_POSITION                equ 0004h
PWM4OFH_PWM4OFH4_SIZE                    equ 0001h
PWM4OFH_PWM4OFH4_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH4_MASK                    equ 0010h
PWM4OFH_PWM4OFH5_POSN                    equ 0005h
PWM4OFH_PWM4OFH5_POSITION                equ 0005h
PWM4OFH_PWM4OFH5_SIZE                    equ 0001h
PWM4OFH_PWM4OFH5_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH5_MASK                    equ 0020h
PWM4OFH_PWM4OFH6_POSN                    equ 0006h
PWM4OFH_PWM4OFH6_POSITION                equ 0006h
PWM4OFH_PWM4OFH6_SIZE                    equ 0001h
PWM4OFH_PWM4OFH6_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH6_MASK                    equ 0040h
PWM4OFH_PWM4OFH7_POSN                    equ 0007h
PWM4OFH_PWM4OFH7_POSITION                equ 0007h
PWM4OFH_PWM4OFH7_SIZE                    equ 0001h
PWM4OFH_PWM4OFH7_LENGTH                  equ 0001h
PWM4OFH_PWM4OFH7_MASK                    equ 0080h
PWM4OFH_PWM4OFH_POSN                     equ 0000h
PWM4OFH_PWM4OFH_POSITION                 equ 0000h
PWM4OFH_PWM4OFH_SIZE                     equ 0008h
PWM4OFH_PWM4OFH_LENGTH                   equ 0008h
PWM4OFH_PWM4OFH_MASK                     equ 00FFh

// Register: PWM4TMRL
#define PWM4TMRL PWM4TMRL
PWM4TMRL                                 equ 0DC9h
// bitfield definitions
PWM4TMRL_TMR_POSN                        equ 0000h
PWM4TMRL_TMR_POSITION                    equ 0000h
PWM4TMRL_TMR_SIZE                        equ 0008h
PWM4TMRL_TMR_LENGTH                      equ 0008h
PWM4TMRL_TMR_MASK                        equ 00FFh
PWM4TMRL_PWM4TMRL0_POSN                  equ 0000h
PWM4TMRL_PWM4TMRL0_POSITION              equ 0000h
PWM4TMRL_PWM4TMRL0_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL0_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL0_MASK                  equ 0001h
PWM4TMRL_PWM4TMRL1_POSN                  equ 0001h
PWM4TMRL_PWM4TMRL1_POSITION              equ 0001h
PWM4TMRL_PWM4TMRL1_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL1_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL1_MASK                  equ 0002h
PWM4TMRL_PWM4TMRL2_POSN                  equ 0002h
PWM4TMRL_PWM4TMRL2_POSITION              equ 0002h
PWM4TMRL_PWM4TMRL2_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL2_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL2_MASK                  equ 0004h
PWM4TMRL_PWM4TMRL3_POSN                  equ 0003h
PWM4TMRL_PWM4TMRL3_POSITION              equ 0003h
PWM4TMRL_PWM4TMRL3_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL3_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL3_MASK                  equ 0008h
PWM4TMRL_PWM4TMRL4_POSN                  equ 0004h
PWM4TMRL_PWM4TMRL4_POSITION              equ 0004h
PWM4TMRL_PWM4TMRL4_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL4_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL4_MASK                  equ 0010h
PWM4TMRL_PWM4TMRL5_POSN                  equ 0005h
PWM4TMRL_PWM4TMRL5_POSITION              equ 0005h
PWM4TMRL_PWM4TMRL5_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL5_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL5_MASK                  equ 0020h
PWM4TMRL_PWM4TMRL6_POSN                  equ 0006h
PWM4TMRL_PWM4TMRL6_POSITION              equ 0006h
PWM4TMRL_PWM4TMRL6_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL6_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL6_MASK                  equ 0040h
PWM4TMRL_PWM4TMRL7_POSN                  equ 0007h
PWM4TMRL_PWM4TMRL7_POSITION              equ 0007h
PWM4TMRL_PWM4TMRL7_SIZE                  equ 0001h
PWM4TMRL_PWM4TMRL7_LENGTH                equ 0001h
PWM4TMRL_PWM4TMRL7_MASK                  equ 0080h
PWM4TMRL_PWM4TMRL_POSN                   equ 0000h
PWM4TMRL_PWM4TMRL_POSITION               equ 0000h
PWM4TMRL_PWM4TMRL_SIZE                   equ 0008h
PWM4TMRL_PWM4TMRL_LENGTH                 equ 0008h
PWM4TMRL_PWM4TMRL_MASK                   equ 00FFh

// Register: PWM4TMRH
#define PWM4TMRH PWM4TMRH
PWM4TMRH                                 equ 0DCAh
// bitfield definitions
PWM4TMRH_TMR_POSN                        equ 0000h
PWM4TMRH_TMR_POSITION                    equ 0000h
PWM4TMRH_TMR_SIZE                        equ 0008h
PWM4TMRH_TMR_LENGTH                      equ 0008h
PWM4TMRH_TMR_MASK                        equ 00FFh
PWM4TMRH_PWM4TMRH0_POSN                  equ 0000h
PWM4TMRH_PWM4TMRH0_POSITION              equ 0000h
PWM4TMRH_PWM4TMRH0_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH0_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH0_MASK                  equ 0001h
PWM4TMRH_PWM4TMRH1_POSN                  equ 0001h
PWM4TMRH_PWM4TMRH1_POSITION              equ 0001h
PWM4TMRH_PWM4TMRH1_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH1_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH1_MASK                  equ 0002h
PWM4TMRH_PWM4TMRH2_POSN                  equ 0002h
PWM4TMRH_PWM4TMRH2_POSITION              equ 0002h
PWM4TMRH_PWM4TMRH2_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH2_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH2_MASK                  equ 0004h
PWM4TMRH_PWM4TMRH3_POSN                  equ 0003h
PWM4TMRH_PWM4TMRH3_POSITION              equ 0003h
PWM4TMRH_PWM4TMRH3_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH3_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH3_MASK                  equ 0008h
PWM4TMRH_PWM4TMRH4_POSN                  equ 0004h
PWM4TMRH_PWM4TMRH4_POSITION              equ 0004h
PWM4TMRH_PWM4TMRH4_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH4_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH4_MASK                  equ 0010h
PWM4TMRH_PWM4TMRH5_POSN                  equ 0005h
PWM4TMRH_PWM4TMRH5_POSITION              equ 0005h
PWM4TMRH_PWM4TMRH5_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH5_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH5_MASK                  equ 0020h
PWM4TMRH_PWM4TMRH6_POSN                  equ 0006h
PWM4TMRH_PWM4TMRH6_POSITION              equ 0006h
PWM4TMRH_PWM4TMRH6_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH6_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH6_MASK                  equ 0040h
PWM4TMRH_PWM4TMRH7_POSN                  equ 0007h
PWM4TMRH_PWM4TMRH7_POSITION              equ 0007h
PWM4TMRH_PWM4TMRH7_SIZE                  equ 0001h
PWM4TMRH_PWM4TMRH7_LENGTH                equ 0001h
PWM4TMRH_PWM4TMRH7_MASK                  equ 0080h
PWM4TMRH_PWM4TMRH_POSN                   equ 0000h
PWM4TMRH_PWM4TMRH_POSITION               equ 0000h
PWM4TMRH_PWM4TMRH_SIZE                   equ 0008h
PWM4TMRH_PWM4TMRH_LENGTH                 equ 0008h
PWM4TMRH_PWM4TMRH_MASK                   equ 00FFh

